quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод используется для добавления элемента в конец списка?',
        'options': ['append()', 'insert()', 'extend()', 'add()'],
        'correct_option': 0
    },
    {
        'question': 'Что делает оператор ** в Python?',
        'options': ['Умножение', 'Деление', 'Возведение в степень', 'Остаток от деления'],
        'correct_option': 2
    },
    {
        'question': 'Какой из следующих типов данных является изменяемым (mutable)',
        'options': ['int', 'str', 'list', 'tuple'],
        'correct_option': 2
    },
    {
        'question': 'Какой модуль используется для работы с регулярными выражениями?',
        'options': ['re', 'regex', 'string', 'pattern'],
        'correct_option': 0
    },
    {
        'question': 'Какое ключевое слово используется для определения функции?',
        'options': ['func', 'try', 'class', 'def'],
        'correct_option': 3
    },
    {
        'question': 'Что делает функция range(5)?',
        'options': ['Создает список чисел от 0 до 5', 'Создает последовательность чисел от 0 до 4', 'Создает последовательность чисел от 1 до 5', 'Создает бесконечную последовательность чисел'],
        'correct_option': 1
    },
    {
        'question': 'Какой из следующих операторов используется для проверки на равенство?',
        'options': ['=', '==', '===', '!='],
        'correct_option': 1
    },
    {
        'question': 'Какой из следующих методов используется для чтения всего содержимого файла?',
        'options': ['read()', 'readline()', 'readlines()', 'readall()'],
        'correct_option': 0
    }
]